{
 "title": "Super Version 2.0 (com.macjutsu.super)",
 "description": "Preference settings for S.U.P.E.R.M.A.N. update script. WARNING: Test Mode defaults to true, please remember to set to false before deploying.",
 "__preferencedomain": "com.macjutsu.super",
 "options": {
  "remove_empty_properties": true
 },
 "properties": {
  "JamfProID": {
   "title": "JamfPro ID",
   "description": "Use this when using super with Jamf Pro API account.",
   "type": "string",
   "enum": ["$JSSID"],
   "default": "$JSSID"
  },
  "DefaultDefer": {
   "title": "Default Defer",
   "description": "The number of seconds to defer until the next update attempt if a user chooses not to update restart. It must be between 120 and 86400. Default deferral time is 3600.",
   "type": "integer",
   "default": "3600"
  },
  "FocusDefer": {
   "title": "Focus Defer",
   "description": "The number of seconds to defer the update restart dialog automatically if a process has prevented display sleep (for example, during an active meeting) or the user has Focus or Do Not Disturb enabled. It must be between 120 and 86400. Put X to diasble this option.",
   "type": "string",
   "options": {
    "inputAttributes": {
     "placeholder": "3600"
    }
   }
  },
  "MenuDefer": {
   "title": "Menu Defer",
   "description": "Display a deferral time pop-up menu in the non-deadline update restart dialog that allows the user to overide the DefaultDefer time. It must be between 120 and 86400. Put X to diable this option.",
   "type": "string",
   "options": {
    "inputAttributes": {
     "placeholder": "1800,3600,86400"
    }
   }
  },
  "RecheckDefer": {
   "title": "Recheck Defer",
   "description": "The number of seconds to defer if no software updates are found. It must be between 120 and 2628288. Put X to diable this option.",
   "type": "string",
   "options": {
    "inputAttributes": {
     "placeholder": "86400"
    }
   }
  },
  "FocusCount": {
   "title": "Focus Count",
   "description": "The maximum number of automatic deferrals allowed if the system is in user-enabled Focus/Do Not Disturb or when a process has requested that the display not go to sleep (for example, during an active meeting). Put X to diable this option.",
   "type": "string"
  },
  "SoftCount": {
   "title": "Soft Count",
   "description": "The maximum number of user selected deferrals allowed before the soft deadline automatically restarts for updates without asking the user for approval. Put X to diable this option.",
   "type": "string"
  },
  "HardCount": {
   "title": "Hard Count",
   "description": "The maximum number of user selected deferrals allowed before the computer automatically restarts for updates without asking the user for approval. Put X to diable this option.",
   "type": "string"
  },
  "FocusDays": {
   "title": "Focus Days",
   "description": "The maximum number of days that automatic deferrals are allowed if the system is in user-enabled Focus/Do Not Disturb or when a process has requested that the display not go to sleep (for example, during an active meeting). Put X to diable this option.",
   "type": "string"
  },
  "SoftDays": {
   "title": "Soft Days",
   "description": "The maximum number of days allowed before the soft deadline dialog. The soft deadline is an interactive update restart dialog indicating that no more deferrals are allowed. Put X to diable this option.",
   "type": "string"
  },
  "HardDays": {
   "title": "Hard Days",
   "description": "The maximum number of days allowed before the computer automatically restarts for updates without asking the user for approval. Put X to diable this option.",
   "type": "string"
  },
  "ZeroDay": {
   "title": "Zero Day",
   "description": "Instead of having the days deadline counter automatically select the day zero date. PutX to diable this option.",
   "type": "string",
   "options": {
    "inputAttributes": {
     "placeholder": "YYYY-MM-DD:hh:mm"
    }
   }
  },
  "FocusDate": {
   "title": "Focus Date",
   "description": "This is the last date and time when automatic deferrals are allowed if the system is in user-enabled Focus/Do Not Disturb or when a process has requested that the display not go to sleep (for example, during an active meeting). Put X to diable this option.",
   "type": "string",
   "options": {
    "inputAttributes": {
     "placeholder": "YYYY-MM-DD:hh:mm"
    }
   }
  },
  "SoftDate": {
   "title": "Soft Date",
   "description": "If this date and time have passed, an interactive update restart dialog appears indicating that no more user deferrals are allowed. Put X to diable this option.",
   "type": "string",
   "options": {
    "inputAttributes": {
     "placeholder": "YYYY-MM-DD:hh:mm"
    }
   }
  },
  "HardDate": {
   "title": "Hard Date",
   "description": "If this date has passed, the computer restarts and udpates without asking the user for approval. Put X to diable this option.",
   "type": "string",
   "options": {
    "inputAttributes": {
     "placeholder": "YYYY-MM-DD:hh:mm"
    }
   }
  },
  "DisplayTimeout": {
   "title": "Display Timeout",
   "description": "Sets an automatic timeout for interactive update restart dialogs in seconds. The countdown of the timeout is displayed in the update restart dialog. Put X to diable this option.",
   "type": "string"
  },
  "DisplayRedraw": {
   "title": "Display Redraw",
   "description": "If a user ignores a notification or dialog (for example, it's moved offscreen)this specifies the number of seconds to wait before closing and then reopening the notification or dialog, thus redrawing the notification or dialog back in it's original open possition. Put X to diable this option.",
   "type": "string"
  },
  "DisplayIcon": {
   "title": "Display Icon",
   "description": "Local path or http(s) URL to a file that is the picture to display in  notifications or dialogs. Put X to reset this to default.",
   "type": "string",
   "options": {
    "inputAttributes": {
     "placeholder": "https://example.com/sample.png"
    }
   }
  },
  "IconSizeIbm": {
   "title": "Icon Size IBM",
   "description": "Number of pixels for the DisplayIcon in IBM Notifier dialogs. The value must be in between 96 and 150. Put X to reset this to default.",
   "type": "string",
   "options": {
    "inputAttributes": {
     "placeholder": "128"
    }
   }
  },
  "IconSizeJamf": {
   "title": "Icon Size Jamf",
   "description": "Number of pixels for the --display-icon in jamfHelper dialogs and notifications. The value must be in between 96 and 150. Put X to reset this to default.",
   "type": "string",
   "options": {
    "inputAttributes": {
     "placeholder": "128"
    }
   }
  },
  "PreferJamf": {
   "title": "Prefer Jamf",
   "description": "Prefer jamfHelpler over IBM Notifier.app for user interactions.",
   "type": "boolean"
  },
  "PolicyTriggers": {
   "title": "Policy Triggers",
   "description": "If a restart is required for system updates or forced via ForceRestart, this list of Jamf Policy Triggers runs before any available updates install and the computer restarts.",
   "type": "string",
   "options": {
    "inputAttributes": {
     "placeholder": "triggerA,triggerB,triggerC"
    }
   }
  },
  "SkipUpdates": {
   "title": "Skip Updates",
   "description": "Skip Apple software updates, even if they are available.",
   "type": "boolean"
  },
  "ForceRestart": {
   "title": "ForceRestart",
   "description": "Force a restart even if Apple software updates do not need it.",
   "type": "boolean"
  },
  "TestMode": {
   "title": "Test Mode",
   "description": "Mode to validate parameters, credentials, notifications, dialogs, deferrals, and deadline logic.",
   "type": "boolean",
   "default": "true"
  },
  "TestModeTimeout": {
   "title": "Test Mode Timeout",
   "description": "The amount of time in seconds to leave test notifications and dialogs open before moving on in the workflow.",
   "type": "string"
  },
  "VerboseMode": {
   "title": "Verbose Mode",
   "description": "Mode to generate additional log output.",
   "type": "boolean"
  }
 }
}
